import { Injectable } from "@angular/core";
import { Advertisement } from "./advertisement.model";
import { Observable } from "rxjs/Observable";
import "rxjs/add/observable/from";
import { Filter } from "./filter.model";

@Injectable()
export class StaticDataSource {
    private advertisements: Advertisement[] = [
        new Advertisement(1, "Квартира 1", "г. Москва", "Преображенская площадь",
                             "на длительный срок", 35, "косметический", "открытая", "",
                             "Квартиры", "", 24000),
        new Advertisement(2, "Квартира 2", "г. Москва", "Преображенская площадь",
                             "на длительный срок", 35, "косметический", "открытая", "",
                             "Квартиры", "", 24000),
        new Advertisement(3, "Квартира 3", "г. Москва", "Преображенская площадь",
                             "на длительный срок", 35, "косметический", "открытая", "",
                             "Квартиры", "", 24000),
        new Advertisement(4, "Квартира 4", "г. Москва", "Преображенская площадь",
                             "на длительный срок", 35, "косметический", "открытая", "",
                             "Квартиры", "", 24000),
        new Advertisement(5, "Квартира 5", "г. Москва", "Преображенская площадь",
                             "на длительный срок", 35, "косметический", "открытая", "",
                             "Квартиры", "", 24000),
        new Advertisement(6, "Квартира 6", "г. Москва", "Преображенская площадь",
                             "на длительный срок", 35, "косметический", "открытая", "",
                             "Квартиры", "", 24000),
        new Advertisement(7, "Комната 1", "г. Москва", "Преображенская площадь",
                             "на длительный срок", 35, "косметический", "открытая", "",
                             "Комнаты", "", 24000),
        new Advertisement(8, "Комната 2", "г. Москва", "Преображенская площадь",
                             "на длительный срок", 35, "косметический", "открытая", "",
                             "Комнаты", "", 24000),
        new Advertisement(9, "Комната 3", "г. Москва", "Преображенская площадь",
                             "на длительный срок", 35, "косметический", "открытая", "",
                             "Комнаты", "", 24000),
        new Advertisement(10, "Комната 4", "г. Москва", "Преображенская площадь",
                             "на длительный срок", 35, "косметический", "открытая", "",
                             "Комнаты", "", 24000),
        new Advertisement(11, "Комната 5", "г. Москва", "Преображенская площадь",
                             "на длительный срок", 35, "косметический", "открытая", "",
                             "Комнаты", "", 24000),
        new Advertisement(12, "Комната 6", "г. Москва", "Преображенская площадь",
                             "на длительный срок", 35, "косметический", "открытая", "",
                             "Комнаты", "", 24000)
    ];

    getAdvertisements(): Observable<Advertisement[]> {
        return Observable.from([this.advertisements]);
    }

    saveFilter(filter: Filter): Observable<Filter> {
        console.log(JSON.stringify(filter));
        return Observable.from([filter]);
    }
}